Repository: NormanCrypt/tiktok-downloader
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

source: or
ru: или

source: Send me a link to a {} video and I'll send this video back to you. Also, you can use me in groups. Just add me to the group and send a link to a video.
ru: Отправьте мне ссылку на видео {} и я отправлю его вам. Также вы можете использовать меня в группах. Просто добавьте меня в группу и отправьте ссылку на видео.

source: Start using the bot
ru: Начать использовать бота

source: Thank you for your report! We will try to fix this issue as soon as possible. Your report: <code>{report}</code>
ru: Спасибо за ваш отчет! Мы постараемся исправить эту проблему как можно скорее. Ваш отчет: <code>{report}</code>

source: {} Use /{} to get more information.
ru: {} Используйте /{}, чтобы получить больше информации.

source: Get more information about the bot.
ru: Получить больше информации о боте.

source: Add to group
ru: Добавить в группу

source: Contacts: {contacts_list}
ru: Контакты: {contacts_list}

source: For add in group press keyboard button "{}" and select chat. If you can't add bot to chat, check are you admin. If button didn't show, send /{} to this chat again.
ru: Для добавления бота в группу нажмите кнопку клавиатуры "{}" и выберите чат. Если вы не можете добавить бота в чат, проверьте, являетесь ли вы администратором. Если кнопка не отображается, отправьте /{} в этот чат снова.

source: {} {}Supported Commands: {} Inline queries are supported. Use @{} in any chat to get started. To get history of your inline queries, set empty after mention bot (or add some spaces). To get video from inline query, add link to video after mention bot. {}
ru: {} {}Поддерживаемые команды: {} Inline запросы поддерживаются. Напишите @{} в любом чате для начала работы с ними. Чтобы получить историю ваших встроенных запросов, установите пустое место после упоминания бота (или добавьте несколько пробелов). Чтобы получить видео из встроенного запроса, добавьте ссылку на видео после упоминания бота. {}

source: Clear your history from inline queries.
ru: Отчистите Вашу историю из inline запросов.

source: History cleared.
ru: История очищена.

source: Bot settings
ru: Настройки бота

source: by <code>@{author}</code>
ru: от <code>@{author}</code>

source: On
ru: Вкл

source: Off
ru: Выкл

source: ⬅️ Back
ru: ⬅️ Назад

source: Not implemented yet
ru: Ещё не реализовано

source: Settings for user {mention}
ru: Настройки для пользователя {mention}

source: Settings for chat "{title}"
ru: Настройки для чата "{title}"

source: enabled ✅
ru: включено ✅

source: disabled ❌
ru: выключено ❌

source: ✅ <b>Enabled</b>
ru: ✅ <b>Включено</b>

source: ❌ <b>Disabled</b>
ru: ❌ <b>Выключено</b>

source: 🌍 Change language
ru: 🌍 Изменить язык

source: Language changed to {}!
ru: Сохранение истории изменено на {}!

source: Choose language
ru: Выберите язык

source: 👤 Add author in media
ru: 👤 Автор медиа

source: Add author in media are {}!
ru: Добавление автора в медиа теперь {}!

source: Add author in media (video/audio/images): {} Example: So funny video by <code>@username</code>
ru: Добавление автора в медиа (видео/аудио/изображения): {} Пример: Очень смешное видео от <code>@username</code> из TikTok

source: 🔗 Add original link in media
ru: 🔗 Оригинальная ссылка к медиа

source: Add original link in media are {}!
ru: Добавление оригинальной ссылки на медиа теперь {}!

source: Add original link in media: {} <i>️📝 NOTE!</i> Twitter always add original link in media.
ru: Добавление оригинальной ссылки на медиа: {} <i>️📝 ВАЖНО!</i> Twitter всегда добавляет оригинальную ссылку на медиа.

source: 🏳️ Add flag to TikTok videos/images
ru: 🏳️ Флаг страны TikTok

source: Add flag to TikTok videos/images are {}!
ru: Добавление флага TikTok видео/изображений теперь {}!

source: Adds the flag of the country from which the videos/images was uploaded (author's country): {}
ru: Добавляет флаг страны, из которой были загружены видео/изображения (страна автора): {}

source: 📜 All
ru: 📜 Все

source: 👤 Hash-less
ru: 👤 Без хештегов

source: ❌ None
ru: ❌ Нет

source: 👤 Without hashtags
ru: 👤 Без хештегов

source: ❌ Without description
ru: ❌ Без описания

source: 📃️ Add description to videos/images
ru: 📃️ Описание к медиа

source: Adding description changed to {}!
ru: Добавление описания теперь {}!

source: Choose type of adding the descriptions from the original source to the videos/images: Current: <b>{}</b>
ru: Выберите тип добавления описания из исходного источника к видео/изображениям: Текущий: <b>{}</b>

source: 📬 Add media source to videos/images
ru: 📬️ Источник медиа к медиа

source: Add media source to videos/images are {}!
ru: Добавление источника медиа к видео/изображениям теперь {}!

source: Add the social network where the videos/images were taken from: {} Example: So funny video from TikTok
ru: Добавление социальной сети, из которой были взяты видео/изображения: {} Пример: Очень смешное видео из TikTok

source: 👥 Groups
ru: 👥 Группы

source: 👤 Private
ru: 👤 Приватные

source: ❌ Not save
ru: ❌ Не сохранять

source: 👥 Groups, where bot are added
ru: 👥 Группы, где бот добавлен

source: 👤 Private (in bot chat)
ru: 👤 Приватные (в чате бота)

source: 🔎 Inline queries
ru: 🔎 Inline запросы

source: ❌ Not saving history
ru: ❌ Не сохранять историю

source: 📝 Saving History
ru: 📝 Сохранение истории

source: History saving changed to {}!
ru: Сохранение истории изменено на {}!

source: Choose source to save in history. To see the history, use <i>Inline Query</i>. Current: <b>{}</b>
ru: Выберите источник для сохранения в истории. Чтобы посмотреть историю, используйте <i>Inline запросы</i>.

source: <i>Original video is larger than <b>20 MB</b>, and bot can't send it.</i> <a href="{url}">This is original link</a>
ru: <i>Оригинальное видео больше, чем <b>20 МБ</b>, и бот не может его отправить.</i> <a href="{url}">Это прямая ссылка на оригинальное видео</a>

source: Error sending video: {title} <a href="{url}">Direct link to video</a>
ru: Ошибка отправки видео: {title} <a href="{url}">Прямая ссылка на видео</a>

source: by @{author}
ru: от @{author}

source: from {m_type}
ru: с {m_type}

source: {m_type} video
ru: {m_type} видео

source: Recently added
ru: Недавно добавленные

source: No videos found. You don't think it's correct? Press here!
ru: Видео не найдены. Вы думаете, что это неправильно? Нажмите здесь!

source: Found %d video
ru: Найдено %d видео

source: . Is it correct media? Press here if not!
ru: . Это правильное видео? Нажмите здесь, если нет!
